# 問題.1
# linuxではディレクトリやファイルを階層構造で管理します。
# 「ルートディレクトリ」「ホームディレクトリ」とは何ですか。それぞれ一言で説明してください。

"ルートディレクトリとは、階層の一番上にあるフォルダのこと。"
"ホームディレクトリトとは、ユーザがログインした際、最初に移動するフォルダのこと"

# 問題.2
# 「ルートディレクトリ」「ホームディレクトリ」それぞれに移動するため、ターミナルで打つべきコマンドを答えてください。
"「ルートディレクトリ」 cd /"
"「ホームディレクトリ」 cd"

# 問題.3
# ターミナルでは、フォルダやファイル名の補完機能が使えます。
# これは具体的にどのような機能なのか説明してください。
"フォルダやファイル名を入力する際、途中でTABボタンを押すことで残りに文字が自動で出力される"

# 問題.4
# 現在のカレントディレクトリが~/Desktopだったとします。
# デスクトップに「text」というフォルダがある場合、そのフォルダ名を
# 相対パスおよび絶対パスで表してください。
"相対パス→　text"
"絶対パス→　〜/Desktop/text"


# 解答
# 問題.1
"ターミナルでファイル名等の入力をするときに、途中まで入力してからTabキーを押すと、残りに文字が自動で入力される。
該当するファイル等が複数ある場合は、Tabを２回押すと候補のリストが表示される。"


# 問題.2
"・ルートディレクトリへの移動
> cd /
・ホームディレクトリへの移動
> cd
あるいは
> cd ~"

# 問題.3
"ターミナルでファイル名等の入力をするときに、途中まで入力してからTabキーを押すと、残りに文字が自動で入力される。
該当するファイル等が複数ある場合は、Tabを２回押すと候補のリストが表示される。"

# 問題.4
"
・絶対パス
~/Desktop/text

・相対パス
text
